# Проблема размена монет: поиск количества способов внести сдачу на заданную сумму денег, используя заданный набор номиналов монет.

# Если мы знаем, сколькими способами можно разменять сумму i - coin, то добавление монеты номиналом coin даёт нам такое же количество способов разменять сумму i.
def coin_change(amount, coins):
    dp = [0] * (amount + 1) # Создаём массив dp размером amount + 1, где dp[i] будет хранить количество способов разменять сумму i.
    dp[0] = 1 # существует ровно один способ разменять сумму 0 (не использовать ни одной монеты)
    for coin in coins:
        for i in range(coin, amount + 1): # для каждой суммы i, начиная с номинала монеты, добавляем количество способов разменять сумму i - coin.
            dp[i] += dp[i - coin] # количество способов разменять сумму i равно сумме способов разменять сумму i - coin для каждого номинала coin.
    return dp[amount]

amount = 100
coins = [1, 5, 10]
ways = coin_change(amount, coins)
print(f"Количество способов разменять сумму {amount}: {ways}")